team_schedule_api/app/controllers/api/v1/schedules_controller.rb

    def create

        @schedule = Schedule.new(schedule_params)

        if @schedule.save
---
INSERT INTO "schedules" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "appointment"], ["content", "dasdas"], ["created_at", "2020-06-12 18:31:11.438223"], ["updated_at", "2020-06-12 18:31:11.438223"], ["user_id", 1]]

    def update


        id = Schedule.find_by(title: params[:schedule][:title])[:user_id]
        id2 = params[:schedule][:user_id]
        if (id == id2)
            if @schedule.update(schedule_params)
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."title" = ? LIMIT ?  [["title", "Hang out"], ["LIMIT", 1]]
UPDATE "schedules" SET "content" = ?, "updated_at" = ? WHERE "schedules"."id" = ?  [["content", "with friends at 9pm"], ["updated_at", "2020-06-17 18:39:27.209466"], ["id", 15]]

    def destroy

        id = params[:user_id]
        id2 = Schedule.find_by_id(params[:id].to_i)[:user_id]

        if (id == id2)
            @schedule.destroy
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "schedules" WHERE "schedules"."id" = ?  [["id", 18]]

    def find_schedule
        @schedule =  Schedule.find_by(id:params[:id])
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]